app/controllers/compose_tweets_controller.rb

INSERT INTO "compose_tweets" ("author", "id", "text") VALUES (?, ?, ?)  [["author", "Jayant"], ["id", 403763731819425792], ["text", "Looks like Audrey, Andrew, Jayant and Niraj are doing a fantastic job with this one"]]
---
  def create
    @tweet_text = params[:compose_tweet][:text]
    if @tweet_text.length > 0
      @tweet = Twitter.update(params[:compose_tweet][:text])
      ComposeTweet.create_compose_tweet(@tweet.id, @tweet.text, @current_user.name)

SELECT "compose_tweets".* FROM "compose_tweets"
---
  def index
    @current_twitter_user = Twitter.user
    @timeline = Twitter.user_timeline(@current_twitter_user.screen_name).take(50)
    @compose_tweet = ComposeTweet.all