app/controllers/nfeatures_controller.rb

def new
  @stream = Twitter.user_timeline("uiowa")
  @current_twitter_user = Twitter.user
  @notevalue=Nfeature.create({:tweetid => '2', :notecontent => params[:nfeature][:notecontent],:name => @current_user.name},:without_protection => true)
---
INSERT INTO "nfeatures" ("isnice", "name", "notecontent", "tweetid") VALUES (?, ?, ?, ?)