app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "session_token") VALUES (?, ?, ?, ?)  [["email", "jayantparchure@uiowa.edu"], ["name", "Jayant"], ["password_digest", "$2a$10$NDBucqTCy2OoccHymy4pROvLnQIBZ.IjYFtiqGitCCp5zuEoA3FJi"], ["session_token", "A3AgLRyhaoE-lGU8xf_AGw"]]